Show / Hide Table of Contents
Class ConnectionData
Provides data of the connection
Inheritance
System.Object
ConnectionData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConnectionData
Properties
Improve this Doc   View Source
AnchorGrids
Anchor grids which belongs to the connection
Declaration
public List<AnchorGrid> AnchorGrids { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<AnchorGrid>
Improve this Doc   View Source
Beams
Connected beams
Declaration
public List<BeamData> Beams { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BeamData>
Improve this Doc   View Source
BoltGrids
Bolt grids which belongs to the connection
Declaration
public List<BoltGrid> BoltGrids { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<BoltGrid>
Improve this Doc   View Source
ConcreteBlocks
ConcreteBlocksof the connection
Declaration
public List<ConcreteBlockData> ConcreteBlocks { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ConcreteBlockData>
Improve this Doc   View Source
CutBeamByBeams
cut beam by beams
Declaration
public List<CutBeamByBeamData> CutBeamByBeams { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<CutBeamByBeamData>
Improve this Doc   View Source
FoldedPlates
Folded plate of the connection
Declaration
public List<FoldedPlateData> FoldedPlates { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<FoldedPlateData>
Improve this Doc   View Source
Plates
Plates of the connection
Declaration
public List<PlateData> Plates { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<PlateData>
Improve this Doc   View Source
Welds
Welds of the connection
Declaration
public List<WeldData> Welds { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<WeldData>
 Improve this Doc
 View Source